olax/AirAlert-ESP8266/src/alerts/AlertsClient.h
#pragma once
// HTTP/TLS transport for api.ukrainealarm.com (SPEC 174: transport only, no policy).
#include <Arduino.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClientSecureBearSSL.h>
#include "airalert/AlertsParser.h"
#include "airalert/ApiSnapshotCache.h"
#include "airalert/SnapshotBuilder.h"

class AlertsClient {
public:
    struct Result {
        enum class Kind : uint8_t {
            Ok, NotModified, AuthError, Forbidden, RateLimited,
            HttpError, NetError, ParseError
        };
        Kind kind = Kind::NetError;
        int httpCode = 0;
        uint32_t retryAfterSec = 0;
        airalert::ParseStats stats;
        const char* parseDetail = nullptr; // static string, set on ParseError
        uint32_t heapAtError = 0;
    };

    void begin(const String& token) {
        if (token != token_) invalidateCache();
        token_ = token;
    }
    bool hasToken() const { return token_.length() > 0; }
    void invalidateCache() {
        lastModified_ = "";
        cache_.invalidate();
    }
    bool hasCachedSnapshot() const { return cache_.canAcceptNotModified(); }

#ifdef AIRALERT_DEV
    // Dev-only: poll a local/tunneled emulator instead of production.
    // Set via serial `setmock <url>`; production builds compile this out.
    void setMockUrl(const String& url) {
        if (url != mockUrl_) invalidateCache();
        mockUrl_ = url;
    }
    bool mocked() const { return mockUrl_.length() > 0; }
#endif

    // One poll: GET /api/v3/alerts, stream-parse into the builder.
    // The builder is only committed by the caller on Kind::Ok (SPEC 168).
    Result poll(airalert::SnapshotBuilder& builder);

private:
    Result::Kind parseBody(Stream& in, airalert::SnapshotBuilder& builder, Result& r);

public:

private:
    String token_;
    String lastModified_;
#ifdef AIRALERT_DEV
    String mockUrl_;
#endif
    airalert::ApiSnapshotCache cache_;
    BearSSL::Session session_; // TLS resumption between 15 s polls
};
